terraform plan:
```
aws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240]
aws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18]
aws_spot_instance_request.dev[0]: Refreshing state... [id=sir-hpz6a9kg]
cloudflare_record.dev[0]: Refreshing state... [id=ed312c6e6a6284b0be1254dbe5a644a6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_spot_instance_request.dev[0] has been changed
  ~ resource "aws_spot_instance_request" "dev" {
        id                              = "sir-hpz6a9kg"
      ~ primary_network_interface_id    = "eni-0ad33beb9fac9c8ef" -> "eni-0f20e3a506e737231"
      ~ private_dns                     = "ip-172-16-10-185.ec2.internal" -> "ip-172-16-10-168.ec2.internal"
      ~ private_ip                      = "172.16.10.185" -> "172.16.10.168"
      ~ public_dns                      = "ec2-35-171-9-29.compute-1.amazonaws.com" -> "ec2-52-91-252-211.compute-1.amazonaws.com"
      ~ public_ip                       = "35.171.9.29" -> "52.91.252.211"
      ~ spot_instance_id                = "i-019f82fa50dc8e3f3" -> "i-063920036403de0aa"
        tags                            = {
            "Name" = "dev"
        }
        # (24 unchanged attributes hidden)

      ~ root_block_device {
            tags                  = {}
          ~ volume_id             = "vol-0c2ad64db61cf527d" -> "vol-037bd9069f42f67f3"
            # (7 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_spot_instance_request.dev[0] must be replaced
-/+ resource "aws_spot_instance_request" "dev" {
      ~ ami                                  = "ami-05ad4ed7f9c48178b" -> "ami-031283ff8a43b021c" # forces replacement
      + arn                                  = (known after apply)
      + availability_zone                    = (known after apply)
      - block_duration_minutes               = 0 -> null
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + host_id                              = (known after apply)
      ~ id                                   = "sir-hpz6a9kg" -> (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      ~ instance_interruption_behaviour      = "terminate" -> (known after apply)
      + instance_state                       = (known after apply)
      ~ instance_type                        = "t2.micro" -> "t3.xlarge" # forces replacement
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0f20e3a506e737231" -> (known after apply)
      ~ private_dns                          = "ip-172-16-10-168.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.16.10.168" -> (known after apply)
      ~ public_dns                           = "ec2-52-91-252-211.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.91.252.211" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ spot_bid_status                      = "fulfilled" -> (known after apply)
      ~ spot_instance_id                     = "i-063920036403de0aa" -> (known after apply)
      ~ spot_price                           = "0.005000" -> "0.0050"
      ~ spot_request_state                   = "active" -> (known after apply)
        tags                                 = {
            "Name" = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ valid_from                           = "0001-01-01T00:00:00Z" -> (known after apply)
      ~ valid_until                          = "0001-01-01T00:00:00Z" -> (known after apply)
        # (11 unchanged attributes hidden)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-037bd9069f42f67f3" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # cloudflare_record.dev[0] will be updated in-place
  ~ resource "cloudflare_record" "dev" {
        id              = "ed312c6e6a6284b0be1254dbe5a644a6"
        name            = "dev0"
      ~ value           = "35.171.9.29" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ dev_ip = [
      - "35.171.9.29",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```